lib/tasks/import_data.rake

SELECT  "users".* FROM "users" WHERE "users"."registration" = $1 LIMIT $2  [["registration", "1455261"], ["LIMIT", 1]]
INSERT INTO "contracts" ("journey", "hours", "locations", "department", "document", "office", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	task :journey => :environment do
		registration = ''
		CSV.foreach('lib/assets/ponto.csv', headers: true) do |row|
			if registration != row['registration']
				uid = User.find_by(registration: row['registration']).id
				formatted_row = {
					journey: row['journey'],
					hours: row['hours'],
					locations: row['locations'],
					department: row['department'],
					document: row['document'],
					office: row['office'],
					user_id: uid
				}
				p formatted_row
				Contract.create(formatted_row)

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "registration", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	task :users => :environment do
		registration = ''
		CSV.foreach('lib/assets/ponto.csv', headers: true) do |row|
			if registration != row['registration']
				formatted_row = {
					email: "#{rand}abc@email#{rand}.com",
					kind: 'user',
					password: '12345678',
					registration: row['registration'],
					name: row['name']
				}
				p formatted_row
				User.create(formatted_row)

SELECT  "users".* FROM "users" WHERE "users"."registration" = $1 LIMIT $2  [["registration", "1455261"], ["LIMIT", 1]]
INSERT INTO "presences" ("created_at", "updated_at", "user_id", "in", "out", "date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2019-05-25 23:48:12.493220"], ["updated_at", "2019-05-25 23:48:12.493220"], ["user_id", 278], ["in", "07:39"], ["out", "17:03"], ["date", "18/03/2019"]]
---
	task :presence => :environment do
		CSV.foreach('lib/assets/ponto.csv', headers: true) do |row|
			uid = User.find_by(registration: row['registration']).id
		    formatted_row = {
				user_id: uid,
				date: row['date'],
				in: row['in'],
				out: row['out']
			}

			Presence.create(formatted_row)