app/workers/ponto_web_worker.rb

SELECT  "users".* FROM "users" WHERE "users"."registration" = $1 LIMIT $2  [["registration", "1234"], ["LIMIT", 1]]
---
  def perform (text)
    p text
    User.find_by(registration: '1234')