app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."registration" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["registration", "123456"], ["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
	conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_h).where(["lower(registration) = :value OR lower(email) = :value", { :value => login.downcase }]).first
    elsif conditions.has_key?(:registration) || conditions.has_key?(:email)
      where(conditions.to_h).first